Revit 2027 API
MEPConnectorInfo.IsSecondary Property
 True if this is the secondary connector.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool IsSecondary { get; }
Public ReadOnly Property IsSecondary As Boolean
	Get
public:
property bool IsSecondary {
	bool get ();
}
member IsSecondary : bool with get
Property Value
Boolean
See Also
Reference
MEPConnectorInfo Class
Autodesk.Revit.DB Namespace